{"faveSpots":
[
  {
    "id": 1,
    "name": "The Spring",
    "description": "Near the highest point in the cluster of hills northeast of Arthur's Seat, there is a bowl with a spring at its center. The spring feeds a couple of larger trees. There are some rocks to sit on at the east side of the bowl. This spot is best in winter when the grass is not too overgrown and the water is more visible.",
    "coordinates": [55.948021, -3.157380]
  },
  {
    "id": 2,
    "name": "Stone Throne",
    "description":"Enter the Radical Road from the north. Walk about 50m and you'll round a cliff on your left side. Behind the cliff is a recess in the crags where someone has built a seat out of stone as well as a firepit. The seat is nicely shaded under a tree. If you scramble up the hill behind the seat, you'll find a creepy ceramic head sticking out of the ground with its mouth agape. You can quite easily scramble all the way up to the crest of the crags from here.",
    "coordinates": [55.949764, -3.170370]
  },
  {
    "id": 3,
    "name": "Cave",
    "description": "Approaching Arthur's Seat from the southwest. If you take the main trail, turn right just after the switch backs begin and follow across the face of the rock outcrop. Eventually you'll reach a shabby little nook where the rock is overhanging. Hardly a cave, but shaded and secluded.",
    "coordinates": [55.942087, -3.164346]
  },
  {
    "id": 4,
    "name": "Small Grotto",
    "description": "From Queen's drive, rather than taking the main path toward Arthur's Seat, walk a bit further up the hill as the road curves south. You'll see a staired path to your right. This path scrambles up and through a rocky chute. Once out of the chute, there's a decent trail leading east. After about 150m you can veer off to your right to reach a rocky outcrop. There's a bit of a shady seated spot on the south facing rock.",
    "coordinates": [55.941021, -3.161398]
  },
  {
    "id": 5,
    "name": "The Hideout",
    "description": "A proper spot. Continuing east from the trail that gets you to the small grotto, the path will split. Turn right. The trail will lead into a denser wood with the largest trees in the southern half of Holyrood. You'll enter into an area with somehting of a canopy. Here, you'll find evidence of previous inhabitance including a lot of broken glass so watch your step. Further on, heading down the hill now you'll find a tree with some wooden boards in its branches as if some treehouse structure once existed there. There is a trail leading back down to Queen's Drive from there, but it's pretty steep.",
    "coordinates": [55.941141, -3.160445]
  },
  {
    "id": 6,
    "name": "The Black Wall",
    "description": "Bouldering spot in the South Quarry of the Salisbury Crags. The Blac Wall Traverse is an Edinburgh classic. v5 left to right, v6 the other way.",
    "coordinates": []
  }
]}